howto-mysql.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>mysql howto</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-11 19:52:05 CEST"/>
<meta name="author" content="Antoine Romain Dumont"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">mysql howto</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Setup platform </a></li>
<li><a href="#sec-2">2 Database connection </a></li>
<li><a href="#sec-3">3 Script to create a db locally </a></li>
<li><a href="#sec-4">4 Script to drop the schema of a database: </a></li>
<li><a href="#sec-5">5 Recover the root password if any problem. </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Setup platform </h2>
<div class="outline-text-2" id="text-1">

<p>For linux (maybe mac os x?) platform, mysql is case-sensitive when it creates database
table name.
</p>
<p>
Add the file ~/.my.cnf with this content
</p>


<pre class="src src-sh">[mysqld]
lower-case-table-names = 1
</pre>




<p>
Then restart the service
</p>


<pre class="src src-sh">sudo service mysql restart
</pre>



<p>
or
</p>


<pre class="src src-sh">sudo /etc/init.d/mysql restart
</pre>



</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Database connection </h2>
<div class="outline-text-2" id="text-2">




<pre class="src src-sh">mysql -u root -h localhost -p$<span style="color: #eedd82;">PASSWD</span> $<span style="color: #eedd82;">MY</span>-DB-NAME
</pre>



<p>
no space between passwd and the flag -p for detailing the passwd (not
so secure).
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Script to create a db locally </h2>
<div class="outline-text-2" id="text-3">




<pre class="src src-sql"><span style="color: #00ffff;">CREATE</span> <span style="color: #b0c4de;">USER</span> <span style="color: #ffa07a;">'my-user'</span>@<span style="color: #ffa07a;">'localhost'</span> IDENTIFIED <span style="color: #00ffff;">BY</span> <span style="color: #ffa07a;">'my-user'</span>;
<span style="color: #00ffff;">CREATE</span> DATABASE db-<span style="color: #00ffff;">name</span>-desired;
<span style="color: #00ffff;">GRANT</span> <span style="color: #00ffff;">ALL</span> <span style="color: #00ffff;">ON</span> db-<span style="color: #00ffff;">name</span>-desired.* <span style="color: #00ffff;">TO</span> my-<span style="color: #b0c4de;">user</span>@localhost IDENTIFIED <span style="color: #00ffff;">BY</span> <span style="color: #ffa07a;">'my-user'</span>;
</pre>



</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Script to drop the schema of a database: </h2>
<div class="outline-text-2" id="text-4">

<p>Content of a file named for example drop-schema.sql
</p>


<pre class="src src-sql"><span style="color: #00ffff;">DROP</span> <span style="color: #00ffff;">TABLE</span> <span style="color: #87cefa;">if</span> <span style="color: #00ffff;">exists</span> <span style="color: #00ffff;">table</span>-<span style="color: #00ffff;">name</span>-0-<span style="color: #00ffff;">to</span>-<span style="color: #00ffff;">drop</span>;
<span style="color: #00ffff;">DROP</span> <span style="color: #00ffff;">TABLE</span> <span style="color: #87cefa;">if</span> <span style="color: #00ffff;">exists</span> <span style="color: #00ffff;">table</span>-<span style="color: #00ffff;">name</span>-1-<span style="color: #00ffff;">to</span>-<span style="color: #00ffff;">drop</span>;
...
</pre>




<p>
Content of the script drop-db.sh
</p>


<pre class="src src-sh"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">!/bin/</span><span style="color: #00ffff;">sh</span><span style="color: #ff7f24;">
</span>
<span style="color: #eedd82;">USER</span>=user-name
<span style="color: #eedd82;">PASSWD</span>=user-passwd
<span style="color: #eedd82;">SERVER</span>=server-db
<span style="color: #eedd82;">DATABASE</span>=database-name
<span style="color: #eedd82;">SQL</span>=drop-schema-wikeo.sql

<span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">"mysql -u $USER -p$PASSWD -h $SERVER $DATABASE &lt; $SQL"</span>
mysql -u $<span style="color: #eedd82;">USER</span> -p$<span style="color: #eedd82;">PASSWD</span> -h $<span style="color: #eedd82;">SERVER</span> $<span style="color: #eedd82;">DATABASE</span> &lt; $<span style="color: #eedd82;">SQL</span>
</pre>




</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Recover the root password if any problem. </h2>
<div class="outline-text-2" id="text-5">

<p><a href="http://www.cyberciti.biz/tips/recover-mysql-root-password.html">http://www.cyberciti.biz/tips/recover-mysql-root-password.html</a>
</p></div>
</div>
<div id="postamble">
<p class="author"> Author: Antoine Romain Dumont
<a href="mailto:tony@linux-mi178">&lt;tony@linux-mi178&gt;</a>
</p>
<p class="date"> Date: 2011-08-11 19:52:05 CEST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
